Autodesk.Revit.UI.IFormaOperationServerProxy.GetScenarioModelCounts(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary{System.String,System.Int32}@)
Collects per-bucket scenario model counts for ADP.
counts:
Keyed by a bucket key packed as authoringEngine|origin|representation|version.
Returns:
True when the document is connected and counts were collected.

Autodesk.Revit.UI.IFormaOperationServerProxy.IsDocumentConnectedToFormaScenario(Autodesk.Revit.DB.Document)
Reports whether the document has an active Forma Scenario connection.
document:
The associated document.

Autodesk.Revit.UI.IFormaOperationServerProxy.SyncWithScenario(Autodesk.Revit.DB.Document,Autodesk.Revit.UI.SyncWithScenarioData)
Synchronizes the document with the specified scenario data.
document:
The associated document.
data:
The data containing checkDisconnect and syncImmediately flags.